In [1]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [16]:
df=[4,8,15,16,23,42]

In [18]:
df

[4, 8, 15, 16, 23, 42]

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [19]:
a=[1,2,3,4,5,6,7,8,9,0]

In [44]:
a1=pd.Series(a)

In [45]:
a1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9    0
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [28]:
df={
    "Name":['Alice', 'Bob', 'Claire'],
    "Age":[25,30,27],
    "Gender":['Female','Male','Female']
}

In [39]:
df1=pd.DataFrame(df)

In [36]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [37]:
type(df1)

pandas.core.frame.DataFrame

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

dataframe is a two-dimentional tabular data structure.
pandas series is a one-dimentional labeled array.

In [40]:
df={
    "Name":['Alice', 'Bob', 'Claire'],
    "Age":[25,30,27],
    "Gender":['Female','Male','Female']
}

In [42]:
df1=pd.Series(df)

In [43]:
df1

Name        [Alice, Bob, Claire]
Age                 [25, 30, 27]
Gender    [Female, Male, Female]
dtype: object

In [46]:
type(df1)

pandas.core.series.Series

In [47]:
df1=pd.DataFrame(df)

In [48]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

head,tail,dtype etc

In [50]:
df={
    "Name":['Alice', 'Bob', 'Claire'],
    "Age":[25,30,27],
    "Gender":['Female','Male','Female']
}

In [51]:
df1=pd.DataFrame(df)

In [53]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [54]:
df1.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [55]:
df1.tail(1)

     Name  Age  Gender
2  Claire   27  Female

In [56]:
df1.dtypes

Name      object
Age        int64
Gender    object
dtype: object

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

All mutable

Q7. Create a DataFrame using multiple Series. Explain with an example.